In [1]:
%pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in d:\depi data engineering\layoffs\lib\site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in d:\depi data engineering\layoffs\lib\site-packages (from SQLAlchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in d:\depi data engineering\layoffs\lib\site-packages (from SQLAlchemy) (3.0.3)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
%pip install pandas

Requirement already satisfied: pandas in d:\depi data engineering\layoffs\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in d:\depi data engineering\layoffs\lib\site-packages (from pandas) (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\depi data engineering\layoffs\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\depi data engineering\layoffs\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in d:\depi data engineering\layoffs\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in d:\depi data engineering\layoffs\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
%pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in d:\depi data engineering\layoffs\lib\site-packages (2.9.9)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
from dotenv import load_dotenv
import os

load_dotenv('pwd.env')

db_user = os.getenv('DB_USER')
db_password = os.getenv('DB_PASSWORD')
db_host = os.getenv("DB_HOST")

In [5]:
from sqlalchemy import create_engine, text 

username = db_user
password = db_password
host = db_host
port = '5433'
database = 'postgres'


connection_string = f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}"
engine = create_engine(connection_string)

try:
    with engine.connect() as connection:
        print("connection was successful!")
except Exception as e:
    print("connection failed:", e)

connection was successful!

In [6]:
import pandas as pd 

pd.set_option('display.expand_frame_repr', False)

companies_sorted_path = r'D:\DEPI Data Engineering\personalWork\Company layoffs\archive\companies_sorted.csv'

companies_sorted_data = pd.read_csv(companies_sorted_path)

print(companies_sorted_data.head())

        id                       name         domain  year founded                             industry size range                                locality         country                                    linkedin url  current employee estimate  total employee estimate
0  5872184                        ibm        ibm.com        1911.0  information technology and services     10001+       new york, new york, united states   united states                        linkedin.com/company/ibm                     274047                   716906
1  4425416  tata consultancy services        tcs.com        1968.0  information technology and services     10001+              bombay, maharashtra, india           india  linkedin.com/company/tata-consultancy-services                     190771                   341369
2    21074                  accenture  accenture.com        1989.0  information technology and services     10001+                 dublin, dublin, ireland         ireland                  linkedin.com/company/accenture                     190689                   455768
3  2309813                    us army     goarmy.com        1800.0                             military     10001+     alexandria, virginia, united states   united states                    linkedin.com/company/us-army                     162163                   445958
4  1558607                         ey         ey.com        1989.0                           accounting     10001+  london, greater london, united kingdom  united kingdom              linkedin.com/company/ernstandyoung                     158363                   428960

In [7]:
companies_sorted_data.describe

<bound method NDFrame.describe of               id                              name               domain  year founded                             industry size range                                         locality         country                                       linkedin url  current employee estimate  total employee estimate
0        5872184                               ibm              ibm.com        1911.0  information technology and services     10001+                new york, new york, united states   united states                           linkedin.com/company/ibm                     274047                   716906
1        4425416         tata consultancy services              tcs.com        1968.0  information technology and services     10001+                       bombay, maharashtra, india           india     linkedin.com/company/tata-consultancy-services                     190771                   341369
2          21074                         accenture        accenture.com        1989.0  information technology and services     10001+                          dublin, dublin, ireland         ireland                     linkedin.com/company/accenture                     190689                   455768
3        2309813                           us army           goarmy.com        1800.0                             military     10001+              alexandria, virginia, united states   united states                       linkedin.com/company/us-army                     162163                   445958
4        1558607                                ey               ey.com        1989.0                           accounting     10001+           london, greater london, united kingdom  united kingdom                 linkedin.com/company/ernstandyoung                     158363                   428960
...          ...                               ...                  ...           ...                                  ...        ...                                              ...             ...                                                ...                        ...                      ...
1048570  2031369                        parsonstko       parsonstko.com        2013.0  information technology and services     Nov-50  washington, district of columbia, united states   united states                    linkedin.com/company/parsonstko                          7                        9
1048571  1482565       black onyx corporation, llc          blkonx1.com           NaN                   financial services     Nov-50                 portage, michigan, united states   united states    linkedin.com/company/black-onyx-corporation-llc                          7                        9
1048572  6436490  carol king landscape maintenance  carolkingscapes.com        1960.0                  facilities services     Nov-50                  orlando, florida, united states   united states  linkedin.com/company/carol-king-landscape-main...                          7                       11
1048573  5751781  howell carnegie district library    howelllibrary.org        1906.0                            libraries     Nov-50                  howell, michigan, united states   united states  linkedin.com/company/howell-carnegie-district-...                          7                       13
1048574  5751767                           pricefy       pricefy.com.br        2017.0                    computer software     Nov-50                                              NaN             NaN                       linkedin.com/company/pricefy                          7                        9

[1048575 rows x 11 columns]>

In [8]:
companies_sorted_data = companies_sorted_data.drop(['size range', 'linkedin url'], axis = 1)


companies_sorted_data = companies_sorted_data.dropna()

In [9]:
companies_sorted_data['year founded'] = companies_sorted_data['year founded'].astype(int)
companies_sorted_data

              id                              name               domain  year founded                             industry                                         locality         country  current employee estimate  total employee estimate
0        5872184                               ibm              ibm.com          1911  information technology and services                new york, new york, united states   united states                     274047                   716906
1        4425416         tata consultancy services              tcs.com          1968  information technology and services                       bombay, maharashtra, india           india                     190771                   341369
2          21074                         accenture        accenture.com          1989  information technology and services                          dublin, dublin, ireland         ireland                     190689                   455768
3        2309813                           us army           goarmy.com          1800                             military              alexandria, virginia, united states   united states                     162163                   445958
4        1558607                                ey               ey.com          1989                           accounting           london, greater london, united kingdom  united kingdom                     158363                   428960
...          ...                               ...                  ...           ...                                  ...                                              ...             ...                        ...                      ...
1048567  4352952                      ax3 fulltech         ax3group.com          2009  information technology and services                            madrid, madrid, spain           spain                          7                       13
1048568  4232207          valeo design & marketing   valeomarketing.com          2005            marketing and advertising                memphis, tennessee, united states   united states                          7                       13
1048570  2031369                        parsonstko       parsonstko.com          2013  information technology and services  washington, district of columbia, united states   united states                          7                        9
1048572  6436490  carol king landscape maintenance  carolkingscapes.com          1960                  facilities services                  orlando, florida, united states   united states                          7                       11
1048573  5751781  howell carnegie district library    howelllibrary.org          1906                            libraries                  howell, michigan, united states   united states                          7                       13

[591870 rows x 9 columns]

In [10]:
companies_sorted_data

              id                              name               domain  year founded                             industry                                         locality         country  current employee estimate  total employee estimate
0        5872184                               ibm              ibm.com          1911  information technology and services                new york, new york, united states   united states                     274047                   716906
1        4425416         tata consultancy services              tcs.com          1968  information technology and services                       bombay, maharashtra, india           india                     190771                   341369
2          21074                         accenture        accenture.com          1989  information technology and services                          dublin, dublin, ireland         ireland                     190689                   455768
3        2309813                           us army           goarmy.com          1800                             military              alexandria, virginia, united states   united states                     162163                   445958
4        1558607                                ey               ey.com          1989                           accounting           london, greater london, united kingdom  united kingdom                     158363                   428960
...          ...                               ...                  ...           ...                                  ...                                              ...             ...                        ...                      ...
1048567  4352952                      ax3 fulltech         ax3group.com          2009  information technology and services                            madrid, madrid, spain           spain                          7                       13
1048568  4232207          valeo design & marketing   valeomarketing.com          2005            marketing and advertising                memphis, tennessee, united states   united states                          7                       13
1048570  2031369                        parsonstko       parsonstko.com          2013  information technology and services  washington, district of columbia, united states   united states                          7                        9
1048572  6436490  carol king landscape maintenance  carolkingscapes.com          1960                  facilities services                  orlando, florida, united states   united states                          7                       11
1048573  5751781  howell carnegie district library    howelllibrary.org          1906                            libraries                  howell, michigan, united states   united states                          7                       13

[591870 rows x 9 columns]

In [11]:
companies_sorted_data.to_csv('cleaned_companies_sorted.csv', index = False, sep = ",", encoding = 'utf-8', mode = 'w', header = True )

In [12]:
from sqlalchemy import create_engine

username = db_user
password = db_password
host = db_host
port = '5433'
database = 'companies_data'


connection_string = f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}"
engine = create_engine(connection_string)

try:
    with engine.connect() as connection:
        print("connection was successful!")
except Exception as e:
    print("connection failed:", e)

connection was successful!

In [13]:
import pandas as pd

cleaned_compaines_data = pd.read_csv(r'D:\DEPI Data Engineering\personalWork\Company layoffs\cleaned_companies_sorted.csv')

cleaned_compaines_data.to_sql('cleaned_companies_data', engine, if_exists='append', index = False, schema='companies')

870

<h1>here is the end of the first sheet ----> companies_sorted.csv<h1

<h1>Employee Sample Data.csv<h1>

In [14]:
%pip install numpy

Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: numpy in d:\depi data engineering\layoffs\lib\site-packages (2.1.1)

In [15]:
import pandas as pd 
import numpy as np
pd.set_option('display.expand_frame_repr', False)

employee_sample_data = pd.read_csv(r'D:\DEPI Data Engineering\personalWork\Company layoffs\EmployeeSampleData\Employee Sample Data.csv', encoding_errors='ignore')

print(employee_sample_data)

       EEID        Full Name                 Job Title  Department           Business Unit  Gender  Ethnicity  Age   Hire Date Annual Salary Bonus %        Country       City   Exit Date
0    E02387      Emily Davis                Sr. Manger          IT  Research & Development  Female      Black   55    4/8/2016     $141,604     15%   United States    Seattle  10/16/2021
1    E04105    Theodore Dinh       Technical Architect          IT           Manufacturing    Male      Asian   59  11/29/1997      $99,975      0%           China  Chongqing         NaN
2    E02572     Luna Sanders                  Director     Finance     Speciality Products  Female  Caucasian   50  10/26/2006     $163,099     20%   United States    Chicago         NaN
3    E02832  Penelope Jordan  Computer Systems Manager          IT           Manufacturing  Female  Caucasian   26   9/27/2019      $84,913      7%   United States    Chicago         NaN
4    E01639        Austin Vo               Sr. Analyst     Finance           Manufacturing    Male      Asian   55  11/20/1995      $95,409      0%   United States    Phoenix         NaN
..      ...              ...                       ...         ...                     ...     ...        ...  ...         ...           ...     ...            ...        ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing     Speciality Products    Male  Caucasian   33   9/18/2016      $98,427      0%   United States   Columbus         NaN
996  E01909     Lillian Khan                   Analyst     Finance     Speciality Products  Female      Asian   44   5/31/2010      $47,387      0%           China    Chengdu    1/8/2018
997  E04398      Oliver Yang                  Director   Marketing     Speciality Products    Male      Asian   31   6/10/2019     $176,710     15%   United States      Miami         NaN
998  E02521      Lily Nguyen               Sr. Analyst     Finance     Speciality Products  Female      Asian   33   1/28/2012      $95,960      0%           China    Chengdu         NaN
999  E03545      Sofia Cheng            Vice President  Accounting               Corporate  Female      Asian   63   7/26/2020     $216,195     31%   United States      Miami         NaN

[1000 rows x 14 columns]

In [16]:
employee_sample_data['Exit Date'] = employee_sample_data['Exit Date'].replace(np.nan, 'hired')

In [17]:
employee_sample_data['Annual Salary'] = employee_sample_data['Annual Salary'].str.replace('$', '', regex = False).str.strip()

employee_sample_data['Annual Salary'] = pd.to_numeric(employee_sample_data['Annual Salary'].str.replace(',', ''), errors='coerce')

In [18]:
employee_sample_data['Bonus %'] = employee_sample_data['Bonus %'].str.replace('%', '', regex = False).str.strip()

employee_sample_data['Bonus %'] = pd.to_numeric(employee_sample_data['Bonus %'])

In [19]:
print(employee_sample_data)

       EEID        Full Name                 Job Title  Department           Business Unit  Gender  Ethnicity  Age   Hire Date  Annual Salary  Bonus %        Country       City   Exit Date
0    E02387      Emily Davis                Sr. Manger          IT  Research & Development  Female      Black   55    4/8/2016         141604       15  United States    Seattle  10/16/2021
1    E04105    Theodore Dinh       Technical Architect          IT           Manufacturing    Male      Asian   59  11/29/1997          99975        0          China  Chongqing       hired
2    E02572     Luna Sanders                  Director     Finance     Speciality Products  Female  Caucasian   50  10/26/2006         163099       20  United States    Chicago       hired
3    E02832  Penelope Jordan  Computer Systems Manager          IT           Manufacturing  Female  Caucasian   26   9/27/2019          84913        7  United States    Chicago       hired
4    E01639        Austin Vo               Sr. Analyst     Finance           Manufacturing    Male      Asian   55  11/20/1995          95409        0  United States    Phoenix       hired
..      ...              ...                       ...         ...                     ...     ...        ...  ...         ...            ...      ...            ...        ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing     Speciality Products    Male  Caucasian   33   9/18/2016          98427        0  United States   Columbus       hired
996  E01909     Lillian Khan                   Analyst     Finance     Speciality Products  Female      Asian   44   5/31/2010          47387        0          China    Chengdu    1/8/2018
997  E04398      Oliver Yang                  Director   Marketing     Speciality Products    Male      Asian   31   6/10/2019         176710       15  United States      Miami       hired
998  E02521      Lily Nguyen               Sr. Analyst     Finance     Speciality Products  Female      Asian   33   1/28/2012          95960        0          China    Chengdu       hired
999  E03545      Sofia Cheng            Vice President  Accounting               Corporate  Female      Asian   63   7/26/2020         216195       31  United States      Miami       hired

[1000 rows x 14 columns]

In [20]:
employee_sample_data.dtypes

EEID             object
Full Name        object
Job Title        object
Department       object
Business Unit    object
Gender           object
Ethnicity        object
Age               int64
Hire Date        object
Annual Salary     int64
Bonus %           int64
Country          object
City             object
Exit Date        object
dtype: object

In [21]:
employee_sample_data.to_csv('cleaned_employee_data.csv', index = False, header = True, encoding = 'utf-8', sep = ',', mode = 'w')

In [22]:
from sqlalchemy import create_engine

username = db_user
password = db_password
port = '5433'
host = db_host
database = 'companies_data'

connection_string = f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}"
engine = create_engine(connection_string)

try:
    with engine.connect() as connection:
        print("connection was successful!")
except Exception as e:
    print("connection failed:", e)

connection was successful!

In [23]:
cleaned_employee_data = pd.read_csv(r'D:\DEPI Data Engineering\personalWork\Company layoffs\cleaned_employee_data.csv')

cleaned_employee_data.to_sql('cleaned_employee_data', engine, if_exists = 'append', index = False, schema = 'companies')

1000

<h1>tech_layoffs_location.csv<h1>

In [24]:
import pandas as pd
import numpy as np

pd.set_option('display.expand_frame_repr', False)

tech_layoffs_location = pd.read_csv(r'D:\DEPI Data Engineering\personalWork\Company layoffs\layoffs 2020 - 2024\tech_layoffs_location.csv', sep = ';')

print(tech_layoffs_location.head())

    location_HQ                  Region       State      Country     latitude     longitude  Unnamed: 6  Unnamed: 7
0      Adelaide                     NaN         NaN    Australia  -34,9281805   138,5999312         NaN         NaN
1  Agoura Hills                     NaN  California          USA     34,14791  -118,7657042         NaN         NaN
2     Ahmedabad                     NaN         NaN        India   23,0216238    72,5797068         NaN         NaN
3       Alameda  San Francisco Bay Area  California          USA   37,6090291   -121,899142         NaN         NaN
4     Amsterdam                     NaN         NaN  Netherlands   52,3730796     4,8924534         NaN         NaN

In [25]:
tech_layoffs_location = tech_layoffs_location.drop(['Region'], axis = 1)

In [26]:
print(tech_layoffs_location)

      location_HQ       State      Country     latitude     longitude  Unnamed: 6  Unnamed: 7
0        Adelaide         NaN    Australia  -34,9281805   138,5999312         NaN         NaN
1    Agoura Hills  California          USA     34,14791  -118,7657042         NaN         NaN
2       Ahmedabad         NaN        India   23,0216238    72,5797068         NaN         NaN
3         Alameda  California          USA   37,6090291   -121,899142         NaN         NaN
4       Amsterdam         NaN  Netherlands   52,3730796     4,8924534         NaN         NaN
..            ...         ...          ...          ...           ...         ...         ...
192    Wellington         NaN  New Zealand  -41,2887953   174,7772114         NaN         NaN
193    Wilmington         NaN          USA   39,7459468    -75,546589         NaN         NaN
194         Xi'an         NaN        China    34,261004   108,9423363         NaN         NaN
195         Yavne         NaN       Israel   31,8768863    34,7382974         NaN         NaN
196        Zurich         NaN  Switzerland   47,3744489     8,5410422         NaN         NaN

[197 rows x 7 columns]

In [27]:
tech_layoffs_location['State'] = tech_layoffs_location['State'].fillna(tech_layoffs_location['location_HQ'])

In [28]:
tech_layoffs_location = tech_layoffs_location.iloc[:, :5]

In [29]:
print(tech_layoffs_location)

      location_HQ       State      Country     latitude     longitude
0        Adelaide    Adelaide    Australia  -34,9281805   138,5999312
1    Agoura Hills  California          USA     34,14791  -118,7657042
2       Ahmedabad   Ahmedabad        India   23,0216238    72,5797068
3         Alameda  California          USA   37,6090291   -121,899142
4       Amsterdam   Amsterdam  Netherlands   52,3730796     4,8924534
..            ...         ...          ...          ...           ...
192    Wellington  Wellington  New Zealand  -41,2887953   174,7772114
193    Wilmington  Wilmington          USA   39,7459468    -75,546589
194         Xi'an       Xi'an        China    34,261004   108,9423363
195         Yavne       Yavne       Israel   31,8768863    34,7382974
196        Zurich      Zurich  Switzerland   47,3744489     8,5410422

[197 rows x 5 columns]

In [30]:
tech_layoffs_location['latitude'] = tech_layoffs_location['latitude'].str.replace(',', '.').astype(float)
tech_layoffs_location['longitude'] = tech_layoffs_location['longitude'].str.replace(',', '.').astype(float)

In [31]:
%pip install folium

Requirement already satisfied: folium in d:\depi data engineering\layoffs\lib\site-packages (0.17.0)
Requirement already satisfied: branca>=0.6.0 in d:\depi data engineering\layoffs\lib\site-packages (from folium) (0.7.2)
Requirement already satisfied: jinja2>=2.9 in d:\depi data engineering\layoffs\lib\site-packages (from folium) (3.1.4)
Requirement already satisfied: numpy in d:\depi data engineering\layoffs\lib\site-packages (from folium) (2.1.1)
Requirement already satisfied: requests in d:\depi data engineering\layoffs\lib\site-packages (from folium) (2.32.3)
Requirement already satisfied: xyzservices in d:\depi data engineering\layoffs\lib\site-packages (from folium) (2024.9.0)
Requirement already satisfied: MarkupSafe>=2.0 in d:\depi data engineering\layoffs\lib\site-packages (from jinja2>=2.9->folium) (2.1.5)
Requirement already satisfied: charset-normalizer<4,>=2 in d:\depi data engineering\layoffs\lib\site-packages (from requests->folium) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in d:\depi data engineering\layoffs\lib\site-packages (from requests->folium) (3.8)
Requirement already satisfied: urllib3<3,>=1.21.1 in d:\depi data engineering\layoffs\lib\site-packages (from requests->folium) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in d:\depi data engineering\layoffs\lib\site-packages (from requests->folium) (2024.8.30)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [32]:
import folium

latitude_mean = tech_layoffs_location['latitude'].mean()
longitude_mean = tech_layoffs_location['longitude'].mean()

m = folium.Map(location=[latitude_mean, longitude_mean], zoom_start=5)

for i, row in tech_layoffs_location.iterrows():
    folium.Marker([row['latitude'], row['longitude']], popup=f"Location: {row['location_HQ']}").add_to(m)

m.save("layoffs_location_map.html")

In [33]:
tech_layoffs_location.to_csv('cleaned_tech_layoffs_location.csv', index = False, header = True, encoding = 'utf-8', sep = ';', mode = 'w')

<h1>tech_layoffs_til_Q1_2024.txt<h2>

In [34]:
import pandas as pd 
import numpy as np

pd.set_option('display.expand_frame_repr', False)

tech_layoffs_q1 = pd.read_csv(r'D:\DEPI Data Engineering\personalWork\Company layoffs\layoffs 2020 - 2024\tech_layoffs_til_Q1_2024.txt', sep = ';')

print(tech_layoffs_q1)

       Nr.     #          Company             Location_HQ Country      Continent  Laid_Off Date_layoffs  Percentage  Company_Size_before_Layoffs  Company_Size_after_layoffs        Industry      Stage Money_Raised_in_$_mil  Year        lat         lng
0        1     3        ShareChat               Bengaluru   India           Asia     200.0   2023-12-20        15.0                       1333.0                      1133.0        Consumer   Series H                 $1700  2023  12.971940   77.593690
1        2     4        InSightec                   Haifa  Israel           Asia     100.0   2023-12-19        20.0                        500.0                       400.0      Healthcare    Unknown                  $733  2023  32.818410   34.988500
2        3     6   Enphase Energy  San Francisco Bay Area     USA  North America     350.0   2023-12-18        10.0                       3500.0                      3150.0          Energy   Post-IPO                  $116  2023  37.548270 -121.988570
3        4     7            Udaan               Bengaluru   India           Asia     100.0   2023-12-18        10.0                       1000.0                       900.0          Retail    Unknown                   NaN  2023  12.971940   77.593690
4        5    14           Cruise  San Francisco Bay Area     USA  North America     900.0   2023-12-14        24.0                       3750.0                      2850.0  Transportation   Acquired                $15000  2023  37.774930 -122.419420
...    ...   ...              ...                     ...     ...            ...       ...          ...         ...                          ...                         ...             ...        ...                   ...   ...        ...         ...
1667  1668  3533           TomTom                    Lodz  Poland         Europe      45.0   2023-12-12         NaN                          NaN                         NaN      Transport…   Post-IPO                   NaN  2024  51.768732   19.456991
1668  1669  3534     Chipper Cash  San Francisco Bay Area     USA  North America      15.0   2023-12-11        33.0                         45.0                        30.0         Finance   Series C                  $302  2024  37.774930 -122.419420
1669  1670  3535     Jungle Scout                  Austin     USA  North America       NaN   2023-12-09         NaN                          NaN                         NaN          Retail  Private …                  $110  2024  30.267150  -97.743060
1670  1671  3536  SmileDirectClub               Nashville     USA  North America       NaN   2023-12-09       100.0                          NaN                         0.0      Healthcare   Post-IPO                  $694  2024  36.165890  -86.784440
1671  1672  3537       Sunfolding  San Francisco Bay Area     USA  North America       NaN   2023-12-09       100.0                          NaN                         0.0          Energy   Series B                   $32  2024  37.774930 -122.419420

[1672 rows x 17 columns]

In [35]:
unique_id = tech_layoffs_q1['#'].nunique()
print(unique_id)

tech_layoffs_q1['#'].max()

1672

np.int64(3537)

In [36]:
tech_layoffs_q1 = tech_layoffs_q1.drop(['Stage', 'Nr.'], axis = 1)

In [37]:
print(tech_layoffs_q1)

         #          Company             Location_HQ Country      Continent  Laid_Off Date_layoffs  Percentage  Company_Size_before_Layoffs  Company_Size_after_layoffs        Industry Money_Raised_in_$_mil  Year        lat         lng
0        3        ShareChat               Bengaluru   India           Asia     200.0   2023-12-20        15.0                       1333.0                      1133.0        Consumer                 $1700  2023  12.971940   77.593690
1        4        InSightec                   Haifa  Israel           Asia     100.0   2023-12-19        20.0                        500.0                       400.0      Healthcare                  $733  2023  32.818410   34.988500
2        6   Enphase Energy  San Francisco Bay Area     USA  North America     350.0   2023-12-18        10.0                       3500.0                      3150.0          Energy                  $116  2023  37.548270 -121.988570
3        7            Udaan               Bengaluru   India           Asia     100.0   2023-12-18        10.0                       1000.0                       900.0          Retail                   NaN  2023  12.971940   77.593690
4       14           Cruise  San Francisco Bay Area     USA  North America     900.0   2023-12-14        24.0                       3750.0                      2850.0  Transportation                $15000  2023  37.774930 -122.419420
...    ...              ...                     ...     ...            ...       ...          ...         ...                          ...                         ...             ...                   ...   ...        ...         ...
1667  3533           TomTom                    Lodz  Poland         Europe      45.0   2023-12-12         NaN                          NaN                         NaN      Transport…                   NaN  2024  51.768732   19.456991
1668  3534     Chipper Cash  San Francisco Bay Area     USA  North America      15.0   2023-12-11        33.0                         45.0                        30.0         Finance                  $302  2024  37.774930 -122.419420
1669  3535     Jungle Scout                  Austin     USA  North America       NaN   2023-12-09         NaN                          NaN                         NaN          Retail                  $110  2024  30.267150  -97.743060
1670  3536  SmileDirectClub               Nashville     USA  North America       NaN   2023-12-09       100.0                          NaN                         0.0      Healthcare                  $694  2024  36.165890  -86.784440
1671  3537       Sunfolding  San Francisco Bay Area     USA  North America       NaN   2023-12-09       100.0                          NaN                         0.0          Energy                   $32  2024  37.774930 -122.419420

[1672 rows x 15 columns]

In [38]:
tech_layoffs_q1['Money_Raised_in_$_mil'] = tech_layoffs_q1['Money_Raised_in_$_mil'].str.replace('$', '', regex = False)

tech_layoffs_q1['Money_Raised_in_$_mil'] = pd.to_numeric(tech_layoffs_q1['Money_Raised_in_$_mil'], errors = 'coerce')

print(tech_layoffs_q1)

         #          Company             Location_HQ Country      Continent  Laid_Off Date_layoffs  Percentage  Company_Size_before_Layoffs  Company_Size_after_layoffs        Industry  Money_Raised_in_$_mil  Year        lat         lng
0        3        ShareChat               Bengaluru   India           Asia     200.0   2023-12-20        15.0                       1333.0                      1133.0        Consumer                 1700.0  2023  12.971940   77.593690
1        4        InSightec                   Haifa  Israel           Asia     100.0   2023-12-19        20.0                        500.0                       400.0      Healthcare                  733.0  2023  32.818410   34.988500
2        6   Enphase Energy  San Francisco Bay Area     USA  North America     350.0   2023-12-18        10.0                       3500.0                      3150.0          Energy                  116.0  2023  37.548270 -121.988570
3        7            Udaan               Bengaluru   India           Asia     100.0   2023-12-18        10.0                       1000.0                       900.0          Retail                    NaN  2023  12.971940   77.593690
4       14           Cruise  San Francisco Bay Area     USA  North America     900.0   2023-12-14        24.0                       3750.0                      2850.0  Transportation                15000.0  2023  37.774930 -122.419420
...    ...              ...                     ...     ...            ...       ...          ...         ...                          ...                         ...             ...                    ...   ...        ...         ...
1667  3533           TomTom                    Lodz  Poland         Europe      45.0   2023-12-12         NaN                          NaN                         NaN      Transport…                    NaN  2024  51.768732   19.456991
1668  3534     Chipper Cash  San Francisco Bay Area     USA  North America      15.0   2023-12-11        33.0                         45.0                        30.0         Finance                  302.0  2024  37.774930 -122.419420
1669  3535     Jungle Scout                  Austin     USA  North America       NaN   2023-12-09         NaN                          NaN                         NaN          Retail                  110.0  2024  30.267150  -97.743060
1670  3536  SmileDirectClub               Nashville     USA  North America       NaN   2023-12-09       100.0                          NaN                         0.0      Healthcare                  694.0  2024  36.165890  -86.784440
1671  3537       Sunfolding  San Francisco Bay Area     USA  North America       NaN   2023-12-09       100.0                          NaN                         0.0          Energy                   32.0  2024  37.774930 -122.419420

[1672 rows x 15 columns]

In [39]:
tech_layoffs_q1['Percentage'] = tech_layoffs_q1['Percentage'].fillna(0).astype(int)
tech_layoffs_q1['Company_Size_before_Layoffs'] = tech_layoffs_q1['Company_Size_before_Layoffs'].fillna(0).astype(int)
tech_layoffs_q1['Company_Size_after_layoffs'] = tech_layoffs_q1['Company_Size_after_layoffs'].fillna(0).astype(int)


tech_layoffs_q1['Laid_Off'] = tech_layoffs_q1['Laid_Off'].fillna(0)
tech_layoffs_q1['lat'] = tech_layoffs_q1['lat'].fillna(0)
tech_layoffs_q1['lng'] = tech_layoffs_q1['lng'].fillna(0)

print(tech_layoffs_q1)

         #          Company             Location_HQ Country      Continent  Laid_Off Date_layoffs  Percentage  Company_Size_before_Layoffs  Company_Size_after_layoffs        Industry  Money_Raised_in_$_mil  Year        lat         lng
0        3        ShareChat               Bengaluru   India           Asia     200.0   2023-12-20          15                         1333                        1133        Consumer                 1700.0  2023  12.971940   77.593690
1        4        InSightec                   Haifa  Israel           Asia     100.0   2023-12-19          20                          500                         400      Healthcare                  733.0  2023  32.818410   34.988500
2        6   Enphase Energy  San Francisco Bay Area     USA  North America     350.0   2023-12-18          10                         3500                        3150          Energy                  116.0  2023  37.548270 -121.988570
3        7            Udaan               Bengaluru   India           Asia     100.0   2023-12-18          10                         1000                         900          Retail                    NaN  2023  12.971940   77.593690
4       14           Cruise  San Francisco Bay Area     USA  North America     900.0   2023-12-14          24                         3750                        2850  Transportation                15000.0  2023  37.774930 -122.419420
...    ...              ...                     ...     ...            ...       ...          ...         ...                          ...                         ...             ...                    ...   ...        ...         ...
1667  3533           TomTom                    Lodz  Poland         Europe      45.0   2023-12-12           0                            0                           0      Transport…                    NaN  2024  51.768732   19.456991
1668  3534     Chipper Cash  San Francisco Bay Area     USA  North America      15.0   2023-12-11          33                           45                          30         Finance                  302.0  2024  37.774930 -122.419420
1669  3535     Jungle Scout                  Austin     USA  North America       0.0   2023-12-09           0                            0                           0          Retail                  110.0  2024  30.267150  -97.743060
1670  3536  SmileDirectClub               Nashville     USA  North America       0.0   2023-12-09         100                            0                           0      Healthcare                  694.0  2024  36.165890  -86.784440
1671  3537       Sunfolding  San Francisco Bay Area     USA  North America       0.0   2023-12-09         100                            0                           0          Energy                   32.0  2024  37.774930 -122.419420

[1672 rows x 15 columns]

In [40]:
new_columns_name = {
    'lat' : 'latitude',
    'lng' : 'longitude',
    '#' : 'company_id'
    }

tech_layoffs_q1.rename(columns = new_columns_name, inplace = True)

print(tech_layoffs_q1)

      company_id          Company             Location_HQ Country      Continent  Laid_Off Date_layoffs  Percentage  Company_Size_before_Layoffs  Company_Size_after_layoffs        Industry  Money_Raised_in_$_mil  Year   latitude   longitude
0              3        ShareChat               Bengaluru   India           Asia     200.0   2023-12-20          15                         1333                        1133        Consumer                 1700.0  2023  12.971940   77.593690
1              4        InSightec                   Haifa  Israel           Asia     100.0   2023-12-19          20                          500                         400      Healthcare                  733.0  2023  32.818410   34.988500
2              6   Enphase Energy  San Francisco Bay Area     USA  North America     350.0   2023-12-18          10                         3500                        3150          Energy                  116.0  2023  37.548270 -121.988570
3              7            Udaan               Bengaluru   India           Asia     100.0   2023-12-18          10                         1000                         900          Retail                    NaN  2023  12.971940   77.593690
4             14           Cruise  San Francisco Bay Area     USA  North America     900.0   2023-12-14          24                         3750                        2850  Transportation                15000.0  2023  37.774930 -122.419420
...          ...              ...                     ...     ...            ...       ...          ...         ...                          ...                         ...             ...                    ...   ...        ...         ...
1667        3533           TomTom                    Lodz  Poland         Europe      45.0   2023-12-12           0                            0                           0      Transport…                    NaN  2024  51.768732   19.456991
1668        3534     Chipper Cash  San Francisco Bay Area     USA  North America      15.0   2023-12-11          33                           45                          30         Finance                  302.0  2024  37.774930 -122.419420
1669        3535     Jungle Scout                  Austin     USA  North America       0.0   2023-12-09           0                            0                           0          Retail                  110.0  2024  30.267150  -97.743060
1670        3536  SmileDirectClub               Nashville     USA  North America       0.0   2023-12-09         100                            0                           0      Healthcare                  694.0  2024  36.165890  -86.784440
1671        3537       Sunfolding  San Francisco Bay Area     USA  North America       0.0   2023-12-09         100                            0                           0          Energy                   32.0  2024  37.774930 -122.419420

[1672 rows x 15 columns]

In [41]:
tech_layoffs_q1.dtypes

company_id                       int64
Company                         object
Location_HQ                     object
Country                         object
Continent                       object
Laid_Off                       float64
Date_layoffs                    object
Percentage                       int64
Company_Size_before_Layoffs      int64
Company_Size_after_layoffs       int64
Industry                        object
Money_Raised_in_$_mil          float64
Year                             int64
latitude                       float64
longitude                      float64
dtype: object

In [42]:
tech_layoffs_q1.to_csv('cleaned_tech_layoffs_q1.csv', index = False, header = True, encoding = 'utf-8', sep = ';', mode = 'w')

<h1>tech_layoffs_Q2<h2>

In [43]:
import pandas as pd 
import numpy as np 

tech_layoffs_q2 = pd.read_csv(r'D:\DEPI Data Engineering\personalWork\Company layoffs\layoffs 2020 - 2024\tech_layoffs_Q2_2024.csv')

print(tech_layoffs_q2)

         #        Company    Location_HQ                  Region       State Country      Continent  Laid_Off Date_layoffs Percentage Company_Size_before_Layoffs Company_Size_after_layoffs        Industry     Stage  Money_Raised_in__mil  Year   latitude   longitude
0        1  Tamara Mellon    Los Angeles                     NaN  California     USA  North America      20.0   2020-03-12       40,0                         50                         30           Retail  Series C                  90.0  2020  34.053691 -118.242766
1        2   HopSkipDrive    Los Angeles                     NaN  California     USA  North America       8.0   2020-03-13       10,0                         80                         72   Transportation   Unknown                  45.0  2020  34.053691 -118.242766
2        3    Panda Squad  San Francisco  San Francisco Bay Area  California     USA  North America       6.0   2020-03-13       75,0                          8                          2         Consumer      Seed                   1.0  2020  37.779259 -122.419329
3        4       Help.com         Austin                     NaN         NaN     USA  North America      16.0   2020-03-16      100,0                         16                          0          Support      Seed                   6.0  2020  30.271129  -97.743700
4        5      Inspirato         Denver                     NaN         NaN     USA  North America     130.0   2020-03-16       22,0                        591                        461           Travel  Series C                  79.0  2020  39.739236 -104.984862
...    ...            ...            ...                     ...         ...     ...            ...       ...          ...        ...                         ...                        ...             ...       ...                   ...   ...        ...         ...
1834  1835   Moxion Power       Richmond  San Francisco Bay Area  California     USA  North America     101.0   2024-06-26        NaN                         NaN                        NaN          Energy   Unknown                 124.0  2024  37.538509  -77.434280
1835  1836         Perion       Tel Aviv                     NaN         NaN  Israel           Asia      35.0   2024-06-26        5,0                        700                        665        Marketing  Post-IPO                  76.0  2024  32.085300   34.781806
1836  1837         Planet  San Francisco  San Francisco Bay Area  California     USA  North America     180.0   2024-06-26       17,0                       1059                        879        Aerospace  Post-IPO                 574.0  2024  37.779259 -122.419329
1837  1838       RealPage         Dallas                     NaN         NaN     USA  North America      20.0   2024-06-27        4,0                        500                        480      Real Estate  Acquired                 105.0  2024  32.776272  -96.796856
1838  1839      Priceline        Norwalk                     NaN         NaN     USA  North America     103.0   2024-06-28       17,0                        606                        503           Travel  Acquired                  77.0  2024  41.117597  -73.407897

[1839 rows x 18 columns]

In [44]:
tech_layoffs_q2 = tech_layoffs_q2.drop(['Stage', 'Region', 'State'], axis = 1)

print(tech_layoffs_q2)

         #        Company    Location_HQ Country      Continent  Laid_Off Date_layoffs Percentage Company_Size_before_Layoffs Company_Size_after_layoffs        Industry  Money_Raised_in__mil  Year   latitude   longitude
0        1  Tamara Mellon    Los Angeles     USA  North America      20.0   2020-03-12       40,0                         50                         30           Retail                  90.0  2020  34.053691 -118.242766
1        2   HopSkipDrive    Los Angeles     USA  North America       8.0   2020-03-13       10,0                         80                         72   Transportation                  45.0  2020  34.053691 -118.242766
2        3    Panda Squad  San Francisco     USA  North America       6.0   2020-03-13       75,0                          8                          2         Consumer                   1.0  2020  37.779259 -122.419329
3        4       Help.com         Austin     USA  North America      16.0   2020-03-16      100,0                         16                          0          Support                   6.0  2020  30.271129  -97.743700
4        5      Inspirato         Denver     USA  North America     130.0   2020-03-16       22,0                        591                        461           Travel                  79.0  2020  39.739236 -104.984862
...    ...            ...            ...     ...            ...       ...          ...        ...                         ...                        ...             ...                   ...   ...        ...         ...
1834  1835   Moxion Power       Richmond     USA  North America     101.0   2024-06-26        NaN                         NaN                        NaN          Energy                 124.0  2024  37.538509  -77.434280
1835  1836         Perion       Tel Aviv  Israel           Asia      35.0   2024-06-26        5,0                        700                        665        Marketing                  76.0  2024  32.085300   34.781806
1836  1837         Planet  San Francisco     USA  North America     180.0   2024-06-26       17,0                       1059                        879        Aerospace                 574.0  2024  37.779259 -122.419329
1837  1838       RealPage         Dallas     USA  North America      20.0   2024-06-27        4,0                        500                        480      Real Estate                 105.0  2024  32.776272  -96.796856
1838  1839      Priceline        Norwalk     USA  North America     103.0   2024-06-28       17,0                        606                        503           Travel                  77.0  2024  41.117597  -73.407897

[1839 rows x 15 columns]

In [45]:
min_id = 3538
max_id = 5380

tech_layoffs_q2['#'] = np.random.randint(min_id, max_id + 1, size = len(tech_layoffs_q2))

print(tech_layoffs_q2)

         #        Company    Location_HQ Country      Continent  Laid_Off Date_layoffs Percentage Company_Size_before_Layoffs Company_Size_after_layoffs        Industry  Money_Raised_in__mil  Year   latitude   longitude
0     4716  Tamara Mellon    Los Angeles     USA  North America      20.0   2020-03-12       40,0                         50                         30           Retail                  90.0  2020  34.053691 -118.242766
1     3701   HopSkipDrive    Los Angeles     USA  North America       8.0   2020-03-13       10,0                         80                         72   Transportation                  45.0  2020  34.053691 -118.242766
2     4244    Panda Squad  San Francisco     USA  North America       6.0   2020-03-13       75,0                          8                          2         Consumer                   1.0  2020  37.779259 -122.419329
3     4134       Help.com         Austin     USA  North America      16.0   2020-03-16      100,0                         16                          0          Support                   6.0  2020  30.271129  -97.743700
4     4842      Inspirato         Denver     USA  North America     130.0   2020-03-16       22,0                        591                        461           Travel                  79.0  2020  39.739236 -104.984862
...    ...            ...            ...     ...            ...       ...          ...        ...                         ...                        ...             ...                   ...   ...        ...         ...
1834  5251   Moxion Power       Richmond     USA  North America     101.0   2024-06-26        NaN                         NaN                        NaN          Energy                 124.0  2024  37.538509  -77.434280
1835  4983         Perion       Tel Aviv  Israel           Asia      35.0   2024-06-26        5,0                        700                        665        Marketing                  76.0  2024  32.085300   34.781806
1836  4740         Planet  San Francisco     USA  North America     180.0   2024-06-26       17,0                       1059                        879        Aerospace                 574.0  2024  37.779259 -122.419329
1837  3570       RealPage         Dallas     USA  North America      20.0   2024-06-27        4,0                        500                        480      Real Estate                 105.0  2024  32.776272  -96.796856
1838  5149      Priceline        Norwalk     USA  North America     103.0   2024-06-28       17,0                        606                        503           Travel                  77.0  2024  41.117597  -73.407897

[1839 rows x 15 columns]

In [46]:
tech_layoffs_q2['Percentage'] = tech_layoffs_q2['Percentage'].str.replace(',0', '', regex = False)

tech_layoffs_q2['Percentage'] = pd.to_numeric(tech_layoffs_q2['Percentage'], errors = 'coerce')

print(tech_layoffs_q2)

         #        Company    Location_HQ Country      Continent  Laid_Off Date_layoffs  Percentage Company_Size_before_Layoffs Company_Size_after_layoffs        Industry  Money_Raised_in__mil  Year   latitude   longitude
0     4716  Tamara Mellon    Los Angeles     USA  North America      20.0   2020-03-12        40.0                         50                         30           Retail                  90.0  2020  34.053691 -118.242766
1     3701   HopSkipDrive    Los Angeles     USA  North America       8.0   2020-03-13        10.0                         80                         72   Transportation                  45.0  2020  34.053691 -118.242766
2     4244    Panda Squad  San Francisco     USA  North America       6.0   2020-03-13        75.0                          8                          2         Consumer                   1.0  2020  37.779259 -122.419329
3     4134       Help.com         Austin     USA  North America      16.0   2020-03-16       100.0                         16                          0          Support                   6.0  2020  30.271129  -97.743700
4     4842      Inspirato         Denver     USA  North America     130.0   2020-03-16        22.0                        591                        461           Travel                  79.0  2020  39.739236 -104.984862
...    ...            ...            ...     ...            ...       ...          ...         ...                         ...                        ...             ...                   ...   ...        ...         ...
1834  5251   Moxion Power       Richmond     USA  North America     101.0   2024-06-26         NaN                         NaN                        NaN          Energy                 124.0  2024  37.538509  -77.434280
1835  4983         Perion       Tel Aviv  Israel           Asia      35.0   2024-06-26         5.0                        700                        665        Marketing                  76.0  2024  32.085300   34.781806
1836  4740         Planet  San Francisco     USA  North America     180.0   2024-06-26        17.0                       1059                        879        Aerospace                 574.0  2024  37.779259 -122.419329
1837  3570       RealPage         Dallas     USA  North America      20.0   2024-06-27         4.0                        500                        480      Real Estate                 105.0  2024  32.776272  -96.796856
1838  5149      Priceline        Norwalk     USA  North America     103.0   2024-06-28        17.0                        606                        503           Travel                  77.0  2024  41.117597  -73.407897

[1839 rows x 15 columns]

In [47]:
tech_layoffs_q2['Percentage'] = tech_layoffs_q2['Percentage'].fillna(0).astype(int)

tech_layoffs_q2['Company_Size_before_Layoffs'] = pd.to_numeric(tech_layoffs_q2['Company_Size_before_Layoffs'], errors='coerce')
tech_layoffs_q2['Company_Size_before_Layoffs'] = tech_layoffs_q2['Company_Size_before_Layoffs'].fillna(0).astype(int)

tech_layoffs_q2['Company_Size_after_layoffs'] = pd.to_numeric(tech_layoffs_q2['Company_Size_after_layoffs'], errors='coerce')
tech_layoffs_q2['Company_Size_after_layoffs'] = tech_layoffs_q2['Company_Size_after_layoffs'].fillna(0).astype(int)

tech_layoffs_q2['Laid_Off'] = tech_layoffs_q2['Laid_Off'].fillna(0)
tech_layoffs_q2['latitude'] = tech_layoffs_q2['latitude'].fillna(0)
tech_layoffs_q2['longitude'] = tech_layoffs_q2['longitude'].fillna(0)

print(tech_layoffs_q2)

         #        Company    Location_HQ Country      Continent  Laid_Off Date_layoffs  Percentage  Company_Size_before_Layoffs  Company_Size_after_layoffs        Industry  Money_Raised_in__mil  Year   latitude   longitude
0     4716  Tamara Mellon    Los Angeles     USA  North America      20.0   2020-03-12          40                           50                          30          Retail                  90.0  2020  34.053691 -118.242766
1     3701   HopSkipDrive    Los Angeles     USA  North America       8.0   2020-03-13          10                           80                          72  Transportation                  45.0  2020  34.053691 -118.242766
2     4244    Panda Squad  San Francisco     USA  North America       6.0   2020-03-13          75                            8                           2        Consumer                   1.0  2020  37.779259 -122.419329
3     4134       Help.com         Austin     USA  North America      16.0   2020-03-16         100                           16                           0         Support                   6.0  2020  30.271129  -97.743700
4     4842      Inspirato         Denver     USA  North America     130.0   2020-03-16          22                          591                         461          Travel                  79.0  2020  39.739236 -104.984862
...    ...            ...            ...     ...            ...       ...          ...         ...                          ...                         ...             ...                   ...   ...        ...         ...
1834  5251   Moxion Power       Richmond     USA  North America     101.0   2024-06-26           0                            0                           0          Energy                 124.0  2024  37.538509  -77.434280
1835  4983         Perion       Tel Aviv  Israel           Asia      35.0   2024-06-26           5                          700                         665       Marketing                  76.0  2024  32.085300   34.781806
1836  4740         Planet  San Francisco     USA  North America     180.0   2024-06-26          17                         1059                         879       Aerospace                 574.0  2024  37.779259 -122.419329
1837  3570       RealPage         Dallas     USA  North America      20.0   2024-06-27           4                          500                         480     Real Estate                 105.0  2024  32.776272  -96.796856
1838  5149      Priceline        Norwalk     USA  North America     103.0   2024-06-28          17                          606                         503          Travel                  77.0  2024  41.117597  -73.407897

[1839 rows x 15 columns]

In [48]:
type(tech_layoffs_q2['Company_Size_after_layoffs'].iloc[0])

numpy.int64

In [49]:
new_column_name = {
    '#' : 'company_id',
    'Money_Raised_in__mil' : 'Money_Raised_in_$_mil'
}

tech_layoffs_q2.rename(columns = new_column_name, inplace = True)

print(tech_layoffs_q2)

      company_id        Company    Location_HQ Country      Continent  Laid_Off Date_layoffs  Percentage  Company_Size_before_Layoffs  Company_Size_after_layoffs        Industry  Money_Raised_in_$_mil  Year   latitude   longitude
0           4716  Tamara Mellon    Los Angeles     USA  North America      20.0   2020-03-12          40                           50                          30          Retail                   90.0  2020  34.053691 -118.242766
1           3701   HopSkipDrive    Los Angeles     USA  North America       8.0   2020-03-13          10                           80                          72  Transportation                   45.0  2020  34.053691 -118.242766
2           4244    Panda Squad  San Francisco     USA  North America       6.0   2020-03-13          75                            8                           2        Consumer                    1.0  2020  37.779259 -122.419329
3           4134       Help.com         Austin     USA  North America      16.0   2020-03-16         100                           16                           0         Support                    6.0  2020  30.271129  -97.743700
4           4842      Inspirato         Denver     USA  North America     130.0   2020-03-16          22                          591                         461          Travel                   79.0  2020  39.739236 -104.984862
...          ...            ...            ...     ...            ...       ...          ...         ...                          ...                         ...             ...                    ...   ...        ...         ...
1834        5251   Moxion Power       Richmond     USA  North America     101.0   2024-06-26           0                            0                           0          Energy                  124.0  2024  37.538509  -77.434280
1835        4983         Perion       Tel Aviv  Israel           Asia      35.0   2024-06-26           5                          700                         665       Marketing                   76.0  2024  32.085300   34.781806
1836        4740         Planet  San Francisco     USA  North America     180.0   2024-06-26          17                         1059                         879       Aerospace                  574.0  2024  37.779259 -122.419329
1837        3570       RealPage         Dallas     USA  North America      20.0   2024-06-27           4                          500                         480     Real Estate                  105.0  2024  32.776272  -96.796856
1838        5149      Priceline        Norwalk     USA  North America     103.0   2024-06-28          17                          606                         503          Travel                   77.0  2024  41.117597  -73.407897

[1839 rows x 15 columns]

In [50]:
tech_layoffs_q2.dtypes

company_id                       int32
Company                         object
Location_HQ                     object
Country                         object
Continent                       object
Laid_Off                       float64
Date_layoffs                    object
Percentage                       int64
Company_Size_before_Layoffs      int64
Company_Size_after_layoffs       int64
Industry                        object
Money_Raised_in_$_mil          float64
Year                             int64
latitude                       float64
longitude                      float64
dtype: object

In [51]:
tech_layoffs_q2['company_id'] = tech_layoffs_q2['company_id'].astype('Int64')

In [52]:
tech_layoffs_q2.to_csv('cleaned_tech_layoffs_q2.csv', header = True, index = False, encoding = 'utf-8', sep = ',', mode = 'w')